HW2-master/app/controllers/movies_controller.rb

  def index
    @movies = Movie.order(params[:sort_by])
    if params[:ratings]
      @movies = Movie.where(:rating => params[:ratings].keys).order(params[:sort_by])
---
SELECT "movies".* FROM "movies" ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13')